# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-cls image classification model. For Usage examples see https://docs.ultralytics.com/tasks/classify

# Parameters
nc_age: 5 # number of classes
nc_gender: 3  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 1024]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 1024]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 1024]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
#  - [-1, 1, CBAM, [256]]        # Attention
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 6-P4/16
#  - [-1, 1, CBAM, [512]]        # Attention
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
#  - [-1, 1, CBAM, [1024]]       # Attention
  - [-1, 3, C2f, [1024, True]]  # 11

    # Age extra layers
  - [8, 1, Conv, [1024, 3, 2]] # 12
#  - [9, 1, CBAM, [1024]]       # Attention
  - [9, 3, C2f, [1024, True]]  # 14
  - [10, 1, Conv, [ 1024, 3, 2 ]] # 12
  - [11, 3, C2f, [ 1024, True ]]  # 14

    # Gender extra layers
  - [8, 1, Conv, [1024, 3, 2]] # 15
#  - [11, 1, CBAM, [1024]]       # Attention
  - [13, 3, C2f, [1024, True]]  # 17
  - [14, 1, Conv, [ 1024, 3, 2 ] ] # 15
  - [15, 3, C2f, [ 1024, True ] ]  # 17

# YOLOv8.0n head
head:
  - [12, 1, Classify, [nc_age]]
  - [16, 1, Classify, [nc_gender]]